{"pageProps":{"grammar":[{"lesson":1,"name":"How come","description":"is used to ask sb the reason of smth","examples":["How come he gets away the everything?","How come I ran out of fuel?","How come they have called off our weekly meeting?"]},{"lesson":1,"name":"should have V3","examples":["I should have turned down that job offer.","I shouldn't have give up my driving courses.","He should have settled down 2 months go."],"rules":["Do you think we should have V3(ed)?","Yes, I think wh should have V3(ed)","No, I don't think we should have V3(ed)","No, I think we shouldn't have V3(ed)"]},{"name":"could have V3","description":"is used to say that smth was possible in the past, but didn't happen","lesson":2,"examples":["He could have put up with her cruel words but he decided not to do it","I could have turned down is offer if I had known about bad consequences","He could have got away with his cheating if we hadn't found out the truth"],"rules":["Do you think we could have V3?","Yes, I think I could have V3","No, I don't think I could have V3"]},{"name":"must have V3","lesson":2,"description":"you think smth was very likely to happen in the past","rules":["He / noun must have V3"],"examples":["I can't get through to Peter. He must have gone on a cruise a weak ago.","The boarding is delayed. They must have called off the place because of the bad weather.","There is nobody in the classroom. The lesson mast have already finished"]},{"name":"How long have you been __ing","lesson":3,"rules":["What are you doing?","I am V1 ing","How long have you been V1 ing?","I have been V1ing for / since / the whole time / life"],"examples":["What is she doing?","She is riding a roller coaster right now.","How long has she been riding a roller coaster?","She has been riding a roller coaster for 5 minutes"]},{"name":"How long have you V3?","lesson":3,"rules":["How long have you V3 (be, have, know, respect, hate, love, like)","I have V3 for / since / the whole time / life"],"examples":["How long have you known each other?","Whe have known each other the whole life","How long have you hated your neighbors?","I have hated my neighbors since they moved in."]},{"name":"Therefore","lesson":3,"description":"means as a result of smth that has just been mentioned","examples":["He was quilty of murder therefore he was put in prison","The channel broadcast the true news therefore it was closed","Jack has let me down several times therefore I will not trust him anymore"]},{"name":"Have you V3?","lesson":4,"examples":["Have you finished the project?","Yes, I have finished the project","When did you finish the project?","I finished the project 2 hours ago","I have finished it recently"]},{"name":"I had 3 by the time I V2","lesson":4,"examples":["I had insisted on my oponion by the time they accepted the final solution","Thay had got married to each other by the time they moved to the USA"]},{"name":"I had 3 before I V2","lesson":4,"examples":["He had got a promotion before he went on a bissiness trip"]},{"name":"Unless","lesson":4,"description":"we use it to say that smth will or won't happen if sth else does or doesn't happen. Future is not used.","examples":["You will be sock for a long time unless (если не) you go to the doctor as soon as possible","Unleass you start communicating with your children you wil never bring them up well","Unless we leave the hotel now, we will miss our flight"]},{"name":"Present simple to talk about the future","lesson":5,"examples":["I arrive at 6 tomorrow, Will you meet me at the airport?","The party starts at 7 in the evening. We mustn't be late","Our appointment is next Saturday. Don't miss it"]},{"name":"be about to","lesson":5,"examples":["Look there! She is about to jump with a parachute.","I am aout to be promoted!"],"rules":["I am about to ____"]},{"name":"I will have V3 (by time, by the time he __s, before he __s)","lesson":5,"rules":["Will you have V3 by time / by the time he ___ s / before he ___s","Yes, I will have V3 by time / by the time he ___ s / before he ___s","No, I won't have V3 by time / by the time he ___ s / before he ___s"],"examples":["They will have covered 30 km by sunset.","I'm sure I will have got better by next week.","He will have looked in on you by the time you leave in the hospital.","Will you have come to the airport before plane arrives?"]},{"name":"Whereas","lesson":5,"description":"is used to say that although smth is true of 1 things is is not true for another","examples":["He likes to travel around Europe during vacation whereas he celebrates Chrismas with relatives at home.","My sister was a hard woeking and diligent strudent at school whereas I was a naughty and lazy one.","Peter is a strict boss at work whereas he is a funny and kind father at home."]},{"name":"Once","lesson":6,"description":"means from the time when something happens ('will' is not used after 'once')","rules":["Once (как только) I get the promotion I will celebrate the whole week.","Once she finished her work she will keep us company.","Once you visit some countries in the world you will never be the save again."]},{"name":"for __ to","lesson":6,"rules":["I work hard for my company to develop.","He makes money for his children to study abroad.","She agreed to his demands for her position to be saved.","They presented a car for Mary to be surprised."]},{"name":"call it a day","lesson":6,"description":"Idiom means to stop doing something, especialy working.","examples":["It's already 11 p.m. I think it's high time we called it a day.","You look exhausted. You should call it a day and complete this work tomorrow.","After hiking for 10 kilometers in the mountains they decided to call it a day and continue tomorrow."]},{"name":"so that","lesson":7,"examples":["I do the laundry on Friday so that (для того что бы) can have a rest on weekends. - (can/will)","He is going to reserve a cottage so that (для того что бы) his family will celebrate New Year in the mountains. - (can/will)","I completed my work on time so that (так что) I could go home earlier. - (would/could)","They traveled in October so that they would save some money. - (would/could)"]},{"name":"though","lesson":7,"description":"is used to introduce a statement that makes another statement surprising or unlikely","examples":["Though (хотя, несмотря на, тем не менее) he can fail I am sure he will try","Though (хотя, несмотря на, тем не менее) he let her down several times she still trusts him.","Though they have been together since their childhood they still live each other.","He can't dance he sings well though.","She wore a coat it was a very hot day though"]},{"name":"matter","lesson":8,"description":"means to be important especially to be important to you personally or to have a big effect on what happens","examples":["Will it metter if I do not come to the party?","Does it metter? - No, it doesn't metter at all.","Money was the only thing that mattered to them.","He loves her and noting else metters."]},{"name":"no matter","lesson":8,"description":"is used to say that smth is not important","examples":["No matter how hard ther tries, he couldn't succeed.","No metter what he said nobody believe him.","No metter what happens I will support you."]},{"name":"When pigs fly","lesson":8,"description":"used to say that smth will never happed","examples":["When pigs fly. I will be friends with him again. He has let me down several times.","He will tidy up his room when pihs fly! Talk to him.","I will wear out this awful sweater when pigs fly."]},{"name":"A piace of cake","lesson":8,"description":"is used to say that smth is very easy.","examples":["The last test was a piece of cake for me.","After years of practicing playing the guitar is a piece of cake for me.","You can do it yourself. I know it's a piece of cake for me."]},{"name":"I remember/miss/mind/imagine  ___ing","lesson":9,"rules":["Do you remember / mind / imagine / miss V1 ing?","Yes I remember / mind / imagine / miss V1 ing.","No I don't remember / mind / imagine / miss V1 img."],"examples":["I remember saying that. - Я помню как говорил это","She misses spending time by the sea. - Она скучает за тем как проводила время на море","I imagine living in this flat.","He minds being here with us."]},{"name":"I remember/miss/mind/imagine him/her/they ___ing","lesson":9,"rules":["Do you remember / mind / imagine / miss him / her / them V1 ing?","Yes I remember / mind / imagine / miss him / her / them V1 ing.","No I don't remember / mind / imagine / miss him / her / them V1 img."],"examples":["I remember you lying to me.","She misses him seeing her home.","I can imagine you being rich.","Our superior minds smoking here."]},{"name":"Might","lesson":9,"description":"is used to show that there is a possibility that smth may happen on may be true but you are not at all certain","examples":["She might not want to keep up company.","I might look in on you tomorrow I will let you know.","They might start the party at 7 but I'm not sure.","He might have missed the appointment on Saturday. I should ask the seretary.","Peter might have forgotten to invite you."]},{"name":"Quite","lesson":10,"description":"means very but not extremely ('Quite' comes before 'a/an') - достаточно","examples":["The room in this hotel is quite luxurious.","Touch it is the low season the prices are quite high.","This piece of work takes quite a lony period of time.","She is quite a good employee"]},{"name":"Pretty","lesson":10,"description":"the same as 'rather', but is used in spoken ('Pretty' comes before 'a/an')","examples":["This hotel is pretty crowded he find another one.","It is a pretty convenient to book a room in a hotel in advance.","He is a pretty trustworthy person and I think you can rely on him."]},{"name":"Rather","description":"means the same degree it is more intensive then `quite` ('Rather' comes before 'a/an') - достаточно / сильно / весьма","examples":["He asked me rather a difficult question.","I was rather surpprised at the news.","My viewpoint on this statement is rather different."]},{"name":"Such","lesson":10,"description":"is used to emphosize you description of smth of sb ('such' comes before 'a/an')","examples":["You are such a selfish young man.","His devorse had such unpleasant consequence.","Such bad behaviour is rude."]},{"name":"used to","lesson":11,"examples":["I used to attend university when I was a student.","Peter didn't use to miss the classes. He was a very responsible boy.","They used to go on holiday in the peak season."],"rules":["Did you use to V1?","Yes, I used to V1.","No, I didn't use to V1."]},{"name":"Neither / Nor","lesson":11,"description":"are used to show that a negative statement is also true about another person or thing.","examples":["I don't know how to five first aid. Neither do I / Nor do I / Me neither.","He doesn;t like to cancel his reservation. Neighter does my friend / Not do I.","I didn't know the cause of that accident. Neither did the police.","We couldn't check in at this hotel for a long time. Nor could these guests.","Mary is not my friends anymore. Neither is mine.","They aren't going to book the available tickets in advance. Not is he.","I wasn't able to find the refreshments on the beach. Me neither.","You shouldn't have been so strict with her. Neither should out superior.","I haven't paid the deposit yet. Neither have me."]},{"name":"to be used to (habit)","lesson":12,"examples":["I am used to studying English 3 times a week.","Peter is used to working overtime.","We are used to making up the sentences with words."]},{"name":"In case","lesson":12,"examples":["In case (В случае) I am late I wll call you back."],"rules":["In case I V1 I will V1"]},{"name":"Provided that","lesson":12,"examples":["Provided that (При условии, что) you pass your exam you will be able to enter university."],"rules":["Provided (that) he V1s he will V1"]},{"name":"Unless","lesson":12,"examples":["Unless (Если) he apologies to me for his behaviour I will never talk to him again."],"rules":["Unless he V1s he will V1"]},{"name":"Suppose","lesson":12,"examples":["Suppose (Предположим) you win one million dollar what will you do?"],"rules":["Suppose he V1s he will V1"]},{"name":"Nevertheless","lesson":12,"description":"means 'in spite of' a fact you have just mentioned","examples":["He got into a terrible car crash. Nevertheless he still drives a car.","The weather turned nasty but the concert in the open air was perfect nevertheless.","In short he lied to her nevertheless she still relies on him."]},{"name":"get used to __ing","lesson":13,"description":"We use get used to to talk about the process of becoming familiar with something. (привыкать)","rules":["I am getting used to V1ing","He gets used to V1ing","I can't get used to V1ing","He should get used to V1ing","I will have to get used to V1ing","They will never get used to V1ind."],"examples":["I am getting used to waking up at 8 after my vacation.","Peter can't get used to visiting his in laws every week.","You should get used to being responsible for everything you do.","She will have to get used to going to gym 3 times a week.","I get used to living pets easily."]},{"name":"Second condition with In case","lesson":13,"rules":["In case I v2 I would V1"],"examples":["In case It were cold I would put on a warm coat."]},{"name":"Second condition with Provided","lesson":13,"rules":["Provided he V2 he would V1"],"examples":["Provided that worked well, you would be promoted."]},{"name":"Second condition with Unless","lesson":13,"rules":["Unless they didn't V1 they wouldn't V1"],"examples":["Unless you asked me to stay I would leave."]},{"name":"Second condition with Suppose","lesson":13,"rules":["Suppose they didn't V1 they wouldn't V1"],"examples":["Suppose you were right I wouldn't you anyway."]},{"name":"Question 3d condition","lesson":14,"rules":["What would you have done if had V3","If I had V3 he would have V3"],"examples":["If they had supplied the goods last Monday we would have failed the contract.","If he had calculated the income and the expenses he wouldn't have delayed accomplishing projects."]},{"name":"have sb do smth","lesson":14,"description":"means to get somebody to do something"},{"name":"mixed conditional","lesson":15,"rules":["If I had V3, I would V1"],"examples":["If I had won the lottery I would be rich","If I had graduated from university I would have a better job now","If he hadn`t married her he wouldn`t have such a nice family now"]}]},"__N_SSG":true}